from colorama import init, Fore, Style
from core.utils import center_block

def boot_screen():
    art = r"""
██████╗ ██╗   ██╗ ██████╗ ███████╗███████╗
██╔══██╗╚██╗ ██╔╝██╔═══██╗██╔════╝██╔════╝
██████╔╝ ╚████╔╝ ██║   ██║███████╗███████╗
██╔═══╝   ╚██╔╝  ██║   ██║╚════██║╚════██║
██║        ██║   ╚██████╔╝███████║███████║
╚═╝        ╚═╝    ╚═════╝ ╚══════╝╚══════╝

    PyOSS - Python Operating System (S)
-------------------------------------
     Welcome to your CLI world <3

    ------- statuzs on dc --------- 
"""
    print(Fore.CYAN + center_block(art))
